package com.oop_inheritans;
//абстрактный класс с полями и методами, которые являются общими для страниц
//НЕЛЬЗЯ создать экземпляр абстрактного класса (new)
//другие классы будут наследовать этот класс, чтобы реализовать его методы (или переопределить)
//Полиморфизм - один и тот же вызов (a.say()) работает по-разному в зависимости от реального класса объекта

//абстрактные классы редко испольхуются в автотестах

public abstract class BasePage {
    //модификатор protected значит, что в классах-наследниках будет доступ к этой переменной
    //модфикиатор final значит, что значение переменной нельзя будет изменить в дальнейшем (?)
    protected final String baseUrl;

    //каждый наследник будет реализовывать значение ссылки по-своему, поэтому нужно добавить КОНСТРУКТОР, в котором будет происходить
    //инициализация переменной baseUrl
    //конструкторы нужны, чтобы создать экземпляр и сразу передать значение. т.е. нельзя будет создать экземляр класса BasePage
    //без передачи параметра baseUrl, т.к. в этом случае мы не создали второй ПУСТОЙ вариант конструктора
    protected BasePage(String baseUrl) {
        this.baseUrl = baseUrl;
    }

    //абстрактные методы, которые будут ОБЯЗАНЫ реализовать классы-наследники
    public abstract String url();
    public abstract String readySelector();

    public void waitLoaded() {
        System.out.println("[WAIT]" + readySelector() + " visible");
    }

    public void open() {
        System.out.println("[NAV] open url " + url());
    }
}
