package com.oop_inheritans;

public interface Flyable {
    //Чистый договор без состояния: класс с implements обязан реализовать все методы. default-методы дают готовую реализацию
    //у интерфейса нет реализации, не может быть состояния, нельзя создать экземпляр интерфейса (new)
    //заготовка методов, которые в дальнейшем будут переопределены, т.е. реализованы по-своему
    //интерфейс описывает какое-то общее свойство объектов, которые могут быть не связаны между собой
    //это договор: какие методы класс обязан иметь
    //имплементированные классы ОБЯЗАНЫ реализовать методы интерфейса (т.к. в интерфейсе у них нет реализации)
    void fly();

    //можно написать метод с реализацией, но так делают редко
    //имплементированные классы не обязаны реализовывать эти методы, т.к. они уже реализованы
    default int minDistance() {
        return 10;
    }

    default void startFly(String name, int distance) {
        System.out.println(name + "начинает полет на дистанцию " + distance);
    }
}
