package com.collections;

import java.util.*;

public class Theory {
    public static void main(String[] args) {

        //LIST

        //Упорядоченный список, может содержать дубликаты, обращаться к элементу можно по индексу (уникальное значение)
        //Это интерфейс, который можно реализовать 4 способами (реализации): ArrayList, LinkedList, Stack, Vektor, но на практике используется только ArrayList
        //отличие между ArrayList и LinkedList: ArrayList - под капотом это массив, который при добавлении или удалении элементов постоянно пересоздается,
        // т.е. это список, который саморасширяется. Реализация подходит, если из списка нужно постоянно что-то доставать
        //LinkedList - это реализация списка, где есть ссылки на соседние элементы, реализация LinkedList. Подходит, если нужно добавлять много новых элементов,
        // за счет этого ускоряется вставка

        //На практике - тест вызывает метод API, получает ответ в структуре json и сохраняет его в виде списка List. Можно проверить количество элементов, наличие конкретного
        // элемента, перебрать все элементы списка

        //создание пустого ИЗМЕНЯЕМОГО списка
        //<String> - это тип/параметр/дженерик, т.е. какой тип данных будет храниться в списке; только ССЫЛОЧНЫЙ тип данных (String, Integer)
        //new ArrayList<>() - это указание того, каким способом мы реализуем список
        List<String> browsers = new ArrayList<>();

        //добавление нового элемента списка
        browsers.add("chrome");
        browsers.add("firefox");
        browsers.add("edge");

        //получение элемента списка по номеру (индексу) и сохранение в переменную
        //(0) - это АРГУМЕНТ метода get
        String order = browsers.get(0);

        //получение размера списка
        int size = browsers.size();

        //проверка, содержит ли список определенный элемент
        boolean safari = browsers.contains("safari");

        //удаление элемента списка
        browsers.remove(0);
        browsers.remove("firefox");

        System.out.println(order);
        System.out.println(size);
        System.out.println(safari);

        //создание готового НЕИЗМЕНЯЕМОГО списка
        //для тестовых данных, где не планируется что-либо добавлять
        List<String> fixed = List.of("a", "b", "c");

        //ЦИКЛ

        //For-each цикл несколько раз выполняет один и тот же код. На практике чаще всего используются при переборе коллекций
        //String browser - тип данных, который принадлежит списку выше; browsers - название переменной с уже созданным списком. Получается,
        // что из списка мы достаем текущий элемент это списка и каждый раз взаимодейтсвуем с каждым элементом этого списка по прядку
        //На практике часто встречается, когда нужно из коллекции перебрать все элементы
        for (String browser : browsers) {
            System.out.println(browser);
        }
        //эквивалентно циклу выше
        //задаем, сколько конкретно раз нужно проитерироваться внутри цикла
        //int i = 0 - локальный счетчик; i < browsers.size() - счетчик должен быть меньше, чем размер списка; i++ - увеличение счетчика после каждой итерации)
        for (int i = 0; i < browsers.size(); i++) {
            String currentBrowser = browsers.get(i);
            System.out.println(currentBrowser);
        }

        //MAP

        //Это дублирование структуры json. Это словарь с ключами и их значениями.
        //<String, String> - указывается тип данных для ключа и значения
        //Map - это интерфейс, который можно реализовать следующими способами (реализации): HashMap, LinkedHashMap, HashTable и т.д., на практике используется только HashMap
        //Как работает: когда создаем новый HashMap, под капотом создается массив из 16 элементов. Каждый элемент внутри массива называется bucket/корзина.
        //Внутри этой корзины есть узлы (ноды), внутри ноды находится ключ, значение, хеш-код, ссылка на следующий элемент. И когда в мапу добавляется новый элемент,
        //происходит вычисление хеш-кода по ключу для того чтобы внутри хеш-таблицы можно было моментально получить значение по ключу.
        //Хеш-код - это число (int), которое позволяет идентифицировать уникальность объекта
        //Map - это моментальный доступ к данным на основе хеш-таблицы
        //Ключ уникальный, если добавить несколько пар с одинаковыми ключами, то значение перезапишется

        //Часто используется для создания http-заголовков или query-параметров

        //Коллизия - когда Java неправильно считает хеш-код для объекта и для 2 разных объектов может посчитаться один хеш-код. Как решить - у каждого объекта есть метод equals,
        //который можно переопределить и точно также можно переопределить хеш-код

        //создание пустой ИЗМЕНЯЕМОЙ мапы
        Map<String, String> cars = new HashMap<>();

        //создание непустой НЕИЗМЕНЯЕМОЙ мапы
        Map<String, Integer> fixedCars = Map.of(
                "KIA", 2,
                "NISSAN", 3);

        //добавление пары в карту
        cars.put("KIA", "GREEN");
        cars.put("KIA", "YELLOW");
        cars.put("NISSAN", "BLACK");

        //получить количество пар в мапе
        System.out.println(cars.size());

        //get - по ключу достаем значение
        System.out.println(cars.get("KIA"));

        //проверить, содержится ли ключ внутри мапы
        cars.containsKey("KIA");

        //удалить пару из мапы
        cars.remove("KIA");

        //цикл для карты, если нужно перебрать все пары
        for (Map.Entry<String, String> stringStringEntry : cars.entrySet()) {
            String key = stringStringEntry.getKey();
            String value = stringStringEntry.getValue();
            System.out.println(key);
            System.out.println(value);
        }


        //SET

        //Это Map без значения, под капотом также хеш-таблица. Это неупорядоченный список без индексов, в котором НЕ могут храниться дубликаты
        //Это интерфейс, который можно реализовать следующими способами (реализации): HashSet, LinkedHashSet, TreeSet
        //Из Set нельзя достать элементы (нет get)
        //Используется для расчета уникальных вещей, на практике - в Set добавляются значения и проверяется его размер (например, события аналитики)

        Set<String> colors = new HashSet<>();

        //добавление
        colors.add("GREEN");
        colors.add("BLACK");
        colors.add("GREEN");

        System.out.println(colors);

        //размерность
        colors.size();

        //содержит ли ключ
        colors.contains("GREEN");

        //удалить
        colors.remove("GREEN");

        //List можно преобразовать в Set например, если нужно оставить только уникальные ключи в List, т.к. при преобразовании уберутся дубликаты ключей

        List<String> duplicatedList = List.of("n1", "n2", "n1");
        Set<String> nonDuplicatedSet = new HashSet<>(duplicatedList);



    }
}
