package com.base.lombok;

import org.junit.jupiter.api.Test;

public class DataExampleTest {
    @Test
    public void test1() {
        //создание объекта класса через конструктор
        //Order order = new Order(1, "PAID", 10.99);

        //builder создает статичный вложенный класс; создаем объект без экземляра класса, т.к. класс статичный
        //можно указывать значения полей в произвольном порядке (при вызове через конструктор нельзя)
        //чтобы в конце создать экзмепляр класса Order, нужно вызвать метод build и зафиксировать в переменную
        //т.о. можно собрать объект, не создавая конструктор на все возможные варианты вх. параметров, например параметр status может быть необязательным
        Order build = Order.builder()
                .price(99.99)
                .id(10)
                .build();

        //теперь при создании объекта класса обязательно нужно передать на вход значение, т.к. в классе есть финальное поле
        Order order = new Order("Burger");

        System.out.println(order);
    }
}


